## 🚨 Production

📝 **6** add, **2** change, **0
0** destroy

<details>
<summary>📋 Click to view full plan details</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_key_vault.main will be created
  + resource "azurerm_key_vault" "main" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "eastus2"
      + name                            = "kv-webapp-prod-3i8r0t"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + rbac_authorization_enabled      = false
      + resource_group_name             = "rg-webapp-prod"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "Component"       = "Security"
          + "CostCenter"      = "Engineering"
          + "Criticality"     = "High"
          + "Environment"     = "prod"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "DevTeam"
          + "Project"         = "webapp"
          + "SecurityControl" = "High"
          + "Service"         = "KeyVault"
        }
      + tenant_id                       = "4140d426-ef7b-4d54-898e-d617ef5335ec"
      + vault_uri                       = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
          + ip_rules       = [
              + "82.65.43.153",
            ]
        }
    }

  # azurerm_key_vault_access_policy.current_user will be created
  + resource "azurerm_key_vault_access_policy" "current_user" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "Create",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = "0d49ce5d-a46d-4e3a-bd30-aea5ec67578f"
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + tenant_id          = "4140d426-ef7b-4d54-898e-d617ef5335ec"
    }

  # azurerm_key_vault_access_policy.webapp will be created
  + resource "azurerm_key_vault_access_policy" "webapp" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sql_password will be created
  + resource "azurerm_key_vault_secret" "sql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sql-admin-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Component"       = "Security"
          + "CostCenter"      = "Engineering"
          + "Criticality"     = "High"
          + "Environment"     = "prod"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "DevTeam"
          + "Project"         = "webapp"
          + "SecurityControl" = "High"
          + "Service"         = "Secret"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_web_app.main will be created
  + resource "azurerm_linux_web_app" "main" {
      + app_settings                                   = (known after apply)
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus2"
      + name                                           = "app-webapp-prod-3i8r0t"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "rg-webapp-prod"
      + service_plan_id                                = "/subscriptions/e1451471-4877-40c5-b65c-46fab5c164f6/resourceGroups/rg-webapp-prod/providers/Microsoft.Web/serverFarms/asp-webapp-prod"
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "Component"       = "Compute"
          + "CostCenter"      = "Engineering"
          + "Criticality"     = "High"
          + "Environment"     = "prod"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "DevTeam"
          + "Project"         = "webapp"
          + "Runtime"         = "Node.js"
          + "SecurityControl" = "High"
          + "Service"         = "WebApp"
        }
      + virtual_network_backup_restore_enabled         = false
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + connection_string {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "FtpsOnly"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version = "18-lts"
            }

          + cors {
              + allowed_origins     = [
                  + "*",
                ]
              + support_credentials = false
            }
        }
    }

  # azurerm_mssql_database.main will be created
  + resource "azurerm_mssql_database" "main" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = (known after apply)
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = 2
      + min_capacity                                               = (known after apply)
      + name                                                       = "sqldb-webapp-prod"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = "/subscriptions/e1451471-4877-40c5-b65c-46fab5c164f6/resourceGroups/rg-webapp-prod/providers/Microsoft.Sql/servers/sql-webapp-prod-3i8r0t"
      + sku_name                                                   = "GP_S_Gen5_1"
      + storage_account_type                                       = "Geo"
      + tags                                                       = {
          + "Component"       = "Database"
          + "CostCenter"      = "Engineering"
          + "Criticality"     = "High"
          + "Environment"     = "prod"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "DevTeam"
          + "Project"         = "webapp"
          + "SecurityControl" = "High"
          + "Service"         = "SQLDatabase"
        }
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = (known after apply)

      + long_term_retention_policy (known after apply)

      + short_term_retention_policy {
          + backup_interval_in_hours = (known after apply)
          + retention_days           = 7
        }

      + threat_detection_policy (known after apply)
    }

  # azurerm_service_plan.main will be updated in-place
  ~ resource "azurerm_service_plan" "main" {
        id                              = "/subscriptions/e1451471-4877-40c5-b65c-46fab5c164f6/resourceGroups/rg-webapp-prod/providers/Microsoft.Web/serverFarms/asp-webapp-prod"
      ~ maximum_elastic_worker_count    = 2 -> 10
        name                            = "asp-webapp-prod"
        tags                            = {
            "Component"       = "Compute"
            "CostCenter"      = "Engineering"
            "Criticality"     = "High"
            "Environment"     = "prod"
            "ManagedBy"       = "Terraform"
            "Owner"           = "DevTeam"
            "Project"         = "webapp"
            "SecurityControl" = "High"
            "Service"         = "AppServicePlan"
        }
        # (11 unchanged attributes hidden)
    }

  # module.storage_account_main.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/e1451471-4877-40c5-b65c-46fab5c164f6/resourceGroups/rg-webapp-prod/providers/Microsoft.Storage/storageAccounts/stwebappprod3i8r0t"
        name                               = "stwebappprod3i8r0t"
      ~ shared_access_key_enabled          = false -> true
        tags                               = {
            "Component"       = "Storage"
            "CostCenter"      = "Engineering"
            "Criticality"     = "High"
            "Environment"     = "prod"
            "ManagedBy"       = "Terraform"
            "Owner"           = "DevTeam"
            "Project"         = "webapp"
            "SecurityControl" = "High"
            "Service"         = "DataStorage"
        }
        # (96 unchanged attributes hidden)

      ~ blob_properties {
            # (5 unchanged attributes hidden)

          ~ container_delete_retention_policy {
              ~ days = 30 -> 7
            }

          ~ delete_retention_policy {
              ~ days                     = 30 -> 7
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 6 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + deployment_summary                       = (sensitive value)
  ~ key_vault_uri                            = "https://kv-webapp-prod-3i8r0t.vault.azure.net/" -> (known after apply)
  + sql_connection_string                    = (sensitive value)
  + web_app_identity_principal_id            = (known after apply)
  + web_app_url                              = (known after apply)
```
</details>

_Commit: 0566bd6_
